chitao5158/00-basic-esp32E/sdkconfig.defaults
# ==============================================================
# 绿深 ESP32-E 开发板  (module: ESP32-WROOM-32E, 4MB flash)
# TYPE-C 接口, 板载 CH340C, 支持自动下载
# Persistent project defaults. `sdkconfig` is auto-generated and
# will be recreated from these values on set-target / reconfigure.
# ==============================================================

# --- Target chip ---
CONFIG_IDF_TARGET="esp32"

# --- ESP32-D0WD-V3 silicon used on WROOM-32E ---
CONFIG_ESP32_REV_MIN_3=y

# --- SPI flash (WROOM-32E: DIO, 80MHz, 4MB) ---
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# --- Custom 4MB partition table ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions-4Mib.csv"

# --- Console over USB-UART bridge (CH340C) on UART0 @115200 ---
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM_0=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# --- TLS: 内置 CA bundle (验证 Let's Encrypt 证书签发 afl.cn) ---
# CMN (common) 子集已包含 Let's Encrypt ISRG Root X1, 足够验证 afl.cn,
# 比 FULL 省约 30KB flash. 若哪天换了小众 CA 的证书导致握手失败, 改回 FULL.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y

# --- 编译优化: -Os 而非默认的 -Og ---
# 固件曾达 983KB/1024KB. 加 Captive Portal 前必须换 size 优化腾空间.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# --- lwIP socket 数 ---
# Captive Portal 同时要跑: httpd (max_open_sockets + 3 个内部保留)
# + DNS 服务器 UDP + DHCPS + STA. 默认 10 个不够.
# Espressif 官方 captive_portal example 同样把这个值调到 16.
CONFIG_LWIP_MAX_SOCKETS=16

# --- Main task 栈: app_main 里要初始化 WiFi + 跑带 printf/I2C 的循环 ---
# ESP-IDF v6 默认 16384, 之前继承到了 3584 导致 stack overflow
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
